#+BEGIN_COMMENT
.. title: Missing Values
.. slug: missing-values
.. date: 2020-02-20 21:07:15 UTC-08:00
.. tags: kaggle,tutorial,cleaning
.. category: Tutorial
.. link: 
.. description: Part two of kaggle's intermediate machine learning tutorial.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 
#+PROPERTY: header-args :session /run/user/1000/jupyter/kernel-eccdecf3-9100-47e8-99d5-c11af61b8a9f.json
** Remove Training Data with no Target
#+begin_src python :results output :exports both
print(f"{len(train_data):,}")
train_data = train_data.dropna(axis="rows", subset=[Data.target])
print(f"{len(train_data):,}")
#+end_src

#+RESULTS:
: 1,460
: 1,460

Doesn't look like there were any missing target values.

#+begin_src python :results none
y = train_data[Data.target]
x_train = train_data.drop([Data.target], axis="columns")
#+end_src

** Numeric Data Only
#+begin_quote
To keep things simple, we'll use only numerical predictors
#+end_quote

#+begin_src python :results output :exports both
print(len(x_train.columns))
X = x_train.select_dtypes(exclude=["object"])
print(len(X.columns))
#+end_src

#+RESULTS:
: 79
: 36

#+begin_src python :results output :exports both
print(len(test_data.columns))
x_test = test_data.select_dtypes(exclude=["object"])
print(len(x_test.columns))
#+end_src

#+RESULTS:
: 79
: 36
** Step 1: Preliminary investigation

#+begin_src python :results none
missing_by_column = x_train.isna().sum()
missed = missing_by_column[missing_by_column > 0]
print(TABLE(missed, headers=["Column", "Missing"]))
#+end_src

#+RESULTS:
# [goto error]

